In [6]:
#1. Is gender independent of education level? A random sample of 395 people were surveyed and each person was asked to report 
#the highest education level they obtained. The data that resulted from the survey is summarized in the following table:
#High School Bachelors Masters Ph.d. Total
#Female 60 54 46 41 201
#Male 40 44 53 57 194
#Total 100 98 99 98 395
#Are gender and education level dependent at 5% level of significance? In other words, given the data collected above, 
#is there a relationship between the gender of an individual and the level of education that they have obtained?

In [15]:
import pandas as pd
import numpy as np
import scipy.stats as stats
#we have to perform Chi-Squared test of independence
#H0:The two categorical variables are independent.
#H1:The two categorical variables are dependent.
female=[60,54,46,41]
male=[40,44,53,57]
Highschool=[60,40]
Bachelors=[54,44]
Masters=[46,53]
Phd=[41,57]
df=pd.DataFrame({"Education":['Highschool','Bachelors','Masters','Phd','Highschool','Bachelors','Masters','Phd'],"Marks":female+male,"Sex":['M','M','M','M','F','F','F','F']})
df

    Education  Marks Sex
0  Highschool     60   M
1   Bachelors     54   M
2     Masters     46   M
3         Phd     41   M
4  Highschool     40   F
5   Bachelors     44   F
6     Masters     53   F
7         Phd     57   F

In [18]:
df1= pd.crosstab(df.Sex,df.Education,df.Marks,aggfunc="sum",margins=True)
df1

Education  Bachelors  Highschool  Masters  Phd  All
Sex
F                 44          40       53   57  194
M                 54          60       46   41  201
All               98         100       99   98  395

In [49]:
df1.columns=['Bachelors','Highschool','Masters','Phd','gender_Total']
df1.index=['F','M','total']
df1

       Bachelors  Highschool  Masters  Phd  gender_Total
F             44          40       53   57           194
M             54          60       46   41           201
total         98         100       99   98           395

In [53]:
#this is the dataframe of observed values
df2=df1.iloc[:2,:4]
df2

   Bachelors  Highschool  Masters  Phd
F         44          40       53   57
M         54          60       46   41

In [54]:
#this is the dataframe of expected values 
#we get expected value from the formula (grand_total*total/sample size)
df3=np.outer(df1["gender_Total"][0:2],df1.loc["total"][0:4]) / 395.0
df3=pd.DataFrame(DF3)
df3.index=["F","M"]
df3.columns=['Bachelors','Highschool','Masters','Phd']
df3

   Bachelors  Highschool    Masters        Phd
F  48.131646   49.113924  48.622785  48.131646
M  49.868354   50.886076  50.377215  49.868354

In [58]:
#we have to perform chi-squared value 
#chi_squared X2=sigma(((observed-expected)**2)/expected)
chi_squared=(((df3-df2)**2)/df3).sum().sum()
print(chi_squared)

8.006066246262538

In [63]:
#given level of significance is 5%
print("Degree of freedom : 3")
print("From chi_squared table ,critical value of chi_square with degree of freedom 3 is 7.815")
print("Since 8.006 > 7.815 it falls in critical region,so we reject null hypothesis and say that that the level of education depends on gender at a 5% significance level")

Degree of freedom : 3
From chi_squared table ,critical value of chi_square with degree of freedom 3 is 7.815
Since 8.006 > 7.815 it falls in critical region,so we reject null hypothesis and say that that the level of education depends on gender at a 5% significance level

# 2.Using the following data, perform a oneway analysis of variance using Î±=.05. Write up the results in APA format.

[Group1: 51, 45, 33, 45, 67]
[Group2: 23, 43, 23, 43, 45]
[Group3: 56, 76, 74, 87, 56]

In [11]:
import scipy.stats as stats
Group1=[51, 45, 33, 45, 67]
Group2=[23, 43, 23, 43, 45]
Group3=[56, 76, 74, 87, 56]
statistic,pvalue=stats.f_oneway(Group1,Group2,Group3)
print("F-value :",statistic," and  pvalue :",pvalue)
alpha=0.05
#given alpha=0.05
#so if pvalue is less than alpha value it is critical region,so we have to reject null hypothesis
if pvalue<alpha:
    print('True beacause pvalue returned is less than 0.05')
else:
    print('False')
print("After performing anova test we came to know that groups have different sample means since pvalue is significant at 99% confidence interval.")

F-value : 9.747205503009463  and  pvalue : 0.0030597541434430556
True beacause pvalue returned is less than 0.05
After performing anova test we came to know that groups have different sample means since pvalue is significant at 99% confidence interval.

# 3.Calculate F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25.

In [10]:
import numpy as np
data_setA=np.array([10, 20, 30, 40, 50])
data_setB=np.array([5,10,15, 20, 25])
degree_of_freedomA=data_setA.size-1
degree_of_freedomB=data_setB.size-1
VarianceA=np.var(data_setA)
VarianceB=np.var(data_setB)
f_value=VarianceA/VarianceB
print("F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25 :",f_value)

F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25 : 4.0